
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ШагНоминальнойСтоимости = Константы.ШагНоминальнойСтоимостиПодарочныхСертификатов.Получить();
	КонтролироватьШагНоминальнойСтоимости = ЗначениеЗаполнено(ШагНоминальнойСтоимости);
	Элементы.ШагНоминальнойСтоимости.Видимость = КонтролироватьШагНоминальнойСтоимости;
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьШагНоминальнойСтоимостиПриИзменении(Элемент)
	Элементы.ШагНоминальнойСтоимости.Видимость = КонтролироватьШагНоминальнойСтоимости;
	
	Если НЕ КонтролироватьШагНоминальнойСтоимости Тогда
		ШагНоминальнойСтоимости = 0;
		УстановитьШагНоминальнойСтоимости(ШагНоминальнойСтоимости);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьШагНоминальнойСтоимости(ШагНоминальнойСтоимости)
	Константы.ШагНоминальнойСтоимостиПодарочныхСертификатов.Установить(ШагНоминальнойСтоимости);
КонецПроцедуры

&НаКлиенте
Процедура ШагНоминальнойСтоимостиПриИзменении(Элемент)
	УстановитьШагНоминальнойСтоимости(ШагНоминальнойСтоимости);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если КонтролироватьШагНоминальнойСтоимости И НЕ ЗначениеЗаполнено(ШагНоминальнойСтоимости) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Шаг номинальной стоимости"" не заполнено.'"), , "ШагНоминальнойСтоимости", , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если КонтролироватьШагНоминальнойСтоимости Тогда
		СтандартнаяОбработка = ПроверитьЗаполнение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьКомандыСгенерироватьПодарочныеСертификаты()
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ФормаОбработкаГенерацияПодарочныхСертификатовСгенерироватьПодарочныеСертификаты.Доступность = ТекущиеДанные.Действует;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьКомандыСгенерироватьПодарочныеСертификаты();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если КонтролироватьШагНоминальнойСтоимости Тогда
		Отказ = НЕ ПроверитьЗаполнение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВидПодарочныхСертификатов_Запись" Тогда
		Элементы.Список.Обновить();
		ОбновитьДоступностьКомандыСгенерироватьПодарочныеСертификаты();
	КонецЕсли;
КонецПроцедуры
