
Процедура ПриЗаписиОбъектаПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИсключаемыеТипы = Новый Массив;
	ИсключаемыеТипы.Добавить(Тип("СправочникОбъект.RMQ_ВиртуальныеХосты"));
	ИсключаемыеТипы.Добавить(Тип("СправочникОбъект.RMQ_ТочкиОбмена"));
	ИсключаемыеТипы.Добавить(Тип("СправочникОбъект.RMQ_Очереди"));
	
	Если ИсключаемыеТипы.Найти(ТипЗнч(Источник)) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	RMQ_ОбменСообщениями.ЗарегистрироватьОбъектыВИсходящихСообщенияхОбмена(Источник);
КонецПроцедуры
