
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодарочныеСертификатыСервер.ЗаполнитьСведенияОПодарочныхСертификатахВДокументе(Объект);
	ПодарочныеСертификатыСервер.ЗаполнитьИтоговыеСуммыНоминаловИНеиспользованныхОстатковПоВалютам(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодарочныеСертификатыСервер.ЗаполнитьСведенияОПодарочныхСертификатахВДокументе(Объект);
	ПодарочныеСертификатыСервер.ЗаполнитьИтоговыеСуммыНоминаловИНеиспользованныхОстатковПоВалютам(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПодарочныеСертификатыСервер.ЗаполнитьСведенияОПодарочныхСертификатахВДокументе(Объект);
	ПодарочныеСертификатыСервер.ЗаполнитьИтоговыеСуммыНоминаловИНеиспользованныхОстатковПоВалютам(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговыеСуммыНоминаловИНеиспользованныхОстатковПоВалютам()
	ПодарочныеСертификатыСервер.ЗаполнитьИтоговыеСуммыНоминаловИНеиспользованныхОстатковПоВалютам(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыПодарочныйСертификатПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПодарочныеСертификаты.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ПодарочныйСертификат) Тогда
		МоментПолученияСведений = ПодарочныеСертификатыСервер.ПолучитьМоментПолученияСведений(Объект.Ссылка, Объект.Дата);
		СведенияОПодарочныхСертификатах = ПодарочныеСертификатыСервер.ПолучитьСведенияОПодарочныхСертификатах(ТекущиеДанные.ПодарочныйСертификат, МоментПолученияСведений);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, СведенияОПодарочныхСертификатах[ТекущиеДанные.ПодарочныйСертификат]);
	Иначе
		ТекущиеДанные.Статус = Неопределено;
		ТекущиеДанные.ОстатокСуммы = 0;
		ТекущиеДанные.ДействуетДо = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыПодарочныйСертификатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПодарочныеСертификаты.ФормаВыбора", Новый Структура("ТолькоАктивированные, ТолькоВозвратные, Ссылка, Дата", Истина, Истина, Объект.Ссылка, Объект.Дата), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПодарочныеСертификатыПриИзменении(Элемент)
	ЗаполнитьИтоговыеСуммыНоминаловИНеиспользованныхОстатковПоВалютам();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьПодборПодарочныхСертификатов", ПодарочныеСертификатыКлиент, Новый Структура("Форма", ЭтотОбъект)); 
	ВыбранныеПодарочныеСертификаты = ПодарочныеСертификатыКлиент.ПолучитьПодарочныеСертификатыДокумента(Объект.ПодарочныеСертификаты);
	ОткрытьФорму("Справочник.ПодарочныеСертификаты.Форма.ФормаВыбора", Новый Структура("МножественныйВыбор, ТолькоАктивированные, ТолькоВозвратные, Ссылка, Дата, ВыбранныеПодарочныеСертификаты", Истина, Истина, Истина, Объект.Ссылка, Объект.Дата, ВыбранныеПодарочныеСертификаты), , ,  , , ОписаниеОповещения);
КонецПроцедуры
