
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	ПодарочныеСертификаты.Ссылка <> &Ссылка
		|	И (ПодарочныеСертификаты.Владелец = &Владелец
		|			ИЛИ &КонтролироватьУникальностьПоВсемВидам)
		|	И ПодарочныеСертификаты.Код = &Код
		|	И НЕ ПодарочныеСертификаты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("КонтролироватьУникальностьПоВсемВидам", ДополнительныеСвойства.КонтролироватьУникальностьПоВсемВидам);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ДополнительныеСвойства.КонтролироватьУникальностьПоВсемВидам Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Уже сгенерирован подарочный сертификат с номером %1'"), Код);
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Уже сгенерирован подарочный сертификат данного вида с номером %1'"), Код);
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ВыборкаДетальныеЗаписи.Ссылка, , , Отказ);	
	КонецЦикла;
КонецПроцедуры
