
&После("ПриНачалеРаботыСистемы")
Процедура RMQ_ПриНачалеРаботыСистемы()
	СтрокаСоединенияИБ = СтрокаСоединенияИнформационнойБазы();
	
	Если ВРег(Лев(СтрокаСоединенияИБ, 5)) = "FILE=" Тогда
		Позиция = СтрНайти(СтрокаСоединенияИБ, "\", НаправлениеПоиска.СКонца);
		ИмяПодкаталога = Сред(СтрокаСоединенияИБ, Позиция + 1);
		ИмяПодкаталога = Лев(ИмяПодкаталога, СтрДлина(ИмяПодкаталога) - 2);
		
		УстановитьЗаголовокПриложения(ИмяПодкаталога);
	Иначе     
		Позиция = СтрНайти(ВРег(СтрокаСоединенияИБ), "REF=");
		Подстрока = Сред(СтрокаСоединенияИБ, Позиция + 5);
		ИмяИнформационнойБазы =	Лев(Подстрока, СтрДлина(Подстрока) - 2);
		
		УстановитьЗаголовокПриложения(ИмяИнформационнойБазы);
	КонецЕсли;
КонецПроцедуры
