
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Пока есть проблемы с определением количества сообщений (для этого требуется получение сообщения без его удаления из очереди,
	//но параметр noConfirm метода BasicConsume(), позволяющий указывать, требуется ли или нет подтверждение клиента после чтения на удаление прочитанного сообщения
	//в данной версии не реализован, поэтому скрываем колонку "НепрочитаноСообщений"
	
	Элементы.НепрочитаноСообщений.Видимость = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	МассивСтрок = Строки.ПолучитьКлючи();
	
	Если МассивСтрок.Количество() > 0 Тогда
		Если Строки.Получить(МассивСтрок[0]).Оформление.Получить("НепрочитаноСообщений") = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	КлиентКомпоненты = RMQ_ОбменСообщениями.ПолучитьКомпонентуСервер();

	Для Каждого Строка Из Строки Цикл
		Данные = Строка.Значение.Данные;
		
		ТаблицаСообщений = RMQ_ОбменСообщениями.ПрочитатьСообщения(КлиентКомпоненты, Данные.Наименование, Ложь, Ложь);
		
		ПолеПредставлениеКоличестваСообщений = Строка.Значение.Оформление.Получить("НепрочитаноСообщений");
		ПолеПредставлениеКоличестваСообщений.УстановитьЗначениеПараметра("Текст", Формат(ТаблицаСообщений.Количество(), "ЧН=0"));
	КонецЦикла;
КонецПроцедуры
