
Функция ПолучитьРеквизитыВидаПодарочныхСертификатов(ВидПодарочныхСертификатов, ИменаРеквизитов) Экспорт
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидПодарочныхСертификатов, ИменаРеквизитов);
КонецФункции

Функция ПолучитьДатуОкончанияДействияСертификата(ПодарочныйСертификат, Дата) Экспорт
	Возврат ДобавитьМесяц(Дата, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодарочныйСертификат, "Владелец.СрокДействия"));
КонецФункции

Функция ПолучитьОстатокСтоимостиПоСертификату(ПодарочныйСертификат, Дата) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификатыОстатки.СуммаОстаток КАК ОстатокСтоимости
		|ИЗ
		|	РегистрНакопления.ПодарочныеСертификаты.Остатки(&Дата, ПодарочныйСертификат = &ПодарочныйСертификат) КАК ПодарочныеСертификатыОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПодарочныйСертификат", ПодарочныйСертификат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ОстатокСтоимости;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Процедура ПроверитьНаличиеДублейПодарочныхСертификатовВДокументе(Документ, ТабличнаяЧасть, Отказ) Экспорт
	ВведенныеСертификаты = Новый Соответствие;

	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Если ВведенныеСертификаты[Строка.ПодарочныйСертификат] = Неопределено Тогда
			ВведенныеСертификаты.Вставить(Строка.ПодарочныйСертификат, Строка.НомерСтроки);
		Иначе     
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В строке %1 подарочный сертификат указан повторно!'"), Строка.НомерСтроки), Документ, "ПодарочныеСертификаты[" + Формат(Строка.НомерСтроки - 1, "ЧГ=") + "].ПодарочныйСертификат", , Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЕстьДублиНомеровПодарочныхСертификатов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодарочныеСертификаты.Код КАК Код,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодарочныеСертификаты.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|ГДЕ
		|	НЕ ПодарочныеСертификаты.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодарочныеСертификаты.Код
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодарочныеСертификаты.Ссылка) > 1";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции