
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВариантГенерацииПодарочныхСертификатов = "с номерами в указанном диапазоне" Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераС");
		Если Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ДиапазонНомераС");
		КонецЕсли;
		
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераПо");
		Если Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ДиапазонНомераПо");
		КонецЕсли;
	Иначе
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераС");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = ПроверяемыеРеквизиты.Найти("ДиапазонНомераПо");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
