
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	СтатусАктивирован = Перечисления.СтатусыПодарочныхСертификатов.Активирован;
	СтатусЧастичноИспользован = Перечисления.СтатусыПодарочныхСертификатов.ЧастичноИспользован;

	Для Каждого Строка Из ПодарочныеСертификаты Цикл 
		Если (Строка.Статус = СтатусАктивирован ИЛИ Строка.Статус = СтатусЧастичноИспользован) И НЕ ЗначениеЗаполнено(Строка.ДействуетДо) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1: не указан срок действия подарочного сертификата!'"), Строка.НомерСтроки), ЭтотОбъект, "ПодарочныеСертификаты[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДействуетДо", , Отказ);
		КонецЕсли;	
		Если Строка.Статус = СтатусЧастичноИспользован И НЕ ЗначениеЗаполнено(Строка.ОстатокСуммы) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1: не указан остаток неиспользованной суммы сертификата!'"), Строка.НомерСтроки), ЭтотОбъект, "ПодарочныеСертификаты[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ОстатокСуммы", , Отказ);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ОстатокСуммы = ПодарочныеСертификаты.Итог("ОстатокСуммы");
КонецПроцедуры

Процедура ПроверитьСрокиДействияИОстаткиСтоимостиПоСертификатам(Отказ)
	РеквизитыВидаПодарочныхСертификатов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидПодарочныхСертификатов, "Валюта, НоминальнаяСтоимость, СрокДействия");
	
	СтатусАктивирован = Перечисления.СтатусыПодарочныхСертификатов.Активирован;
	СтатусЧастичноИспользован = Перечисления.СтатусыПодарочныхСертификатов.ЧастичноИспользован;
	
	Для Каждого Строка Из ПодарочныеСертификаты Цикл
		Если (Строка.Статус = СтатусАктивирован ИЛИ Строка.Статус = СтатусЧастичноИспользован) И КонецДня(Строка.ДействуетДо) < Дата Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1: срок действия подарочного сертификата истек!'"), Строка.НомерСтроки), ЭтотОбъект, "ПодарочныеСертификаты[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДействуетДо", , Отказ);
		КонецЕсли;
		
		Если Строка.Статус = СтатусЧастичноИспользован И Строка.ОстатокСуммы >= РеквизитыВидаПодарочныхСертификатов.НоминальнаяСтоимость Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1: в случае частичного использования остаток неиспользованной суммы должен быть строго меньше номинальной стоимости подарочного сертификата (%2 %3)!'"), 
				Строка.НомерСтроки, РеквизитыВидаПодарочныхСертификатов.НоминальнаяСтоимость, РеквизитыВидаПодарочныхСертификатов.Валюта), ЭтотОбъект, "ПодарочныеСертификаты[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ОстатокСуммы", , Отказ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьДублиВводовОстатковПоПодарочнымСертификатам(Отказ)
	ПодарочныеСертификатыСервер.ПроверитьНаличиеДублейПодарочныхСертификатовВДокументе(ЭтотОбъект, ПодарочныеСертификаты, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат
		|ПОМЕСТИТЬ ВТ_ПодарочныеСертификатыТекущегоДокумента
		|ИЗ
		|	Документ.ВводОстатковПодарочныхСертификатов.ПодарочныеСертификаты КАК ВводОстатковПодарочныхСертификатовПодарочныеСертификаты
		|ГДЕ
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.Ссылка КАК Ссылка,
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат
		|ПОМЕСТИТЬ ВТ_ПодарочныеСертификатыДругихДокументов
		|ИЗ
		|	Документ.ВводОстатковПодарочныхСертификатов.ПодарочныеСертификаты КАК ВводОстатковПодарочныхСертификатовПодарочныеСертификаты
		|ГДЕ
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.Ссылка <> &Ссылка
		|	И ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодарочныеСертификатыДругихДокументов.Ссылка КАК Ссылка,
		|	ВТ_ПодарочныеСертификатыДругихДокументов.ПодарочныйСертификат КАК ПодарочныйСертификат
		|ИЗ
		|	ВТ_ПодарочныеСертификатыТекущегоДокумента КАК ВТ_ПодарочныеСертификатыТекущегоДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПодарочныеСертификатыДругихДокументов КАК ВТ_ПодарочныеСертификатыДругихДокументов
		|		ПО ВТ_ПодарочныеСертификатыТекущегоДокумента.ПодарочныйСертификат = ВТ_ПодарочныеСертификатыДругихДокументов.ПодарочныйСертификат
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;                                                                      
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Внимание! Уже проведены другие документы ввода остатков по подарочным сертификатам из текущего документа:%1'"), Символы.ПС);
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + Символы.ПС + ВыборкаСсылка.Ссылка;
	
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб + ВыборкаДетальныеЗаписи.ПодарочныйСертификат;
		КонецЦикла;
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , , Отказ);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    ПроверитьСрокиДействияИОстаткиСтоимостиПоСертификатам(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
    ПроверитьДублиВводовОстатковПоПодарочнымСертификатам(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ИсторияСтатусовПодарочныхСертификатов.Записывать = Истина;
	Движения.ПодарочныеСертификаты.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.Статус КАК Статус,
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.ОстатокСуммы КАК ОстатокСуммы,
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.ДействуетДо КАК ДействуетДо
		|ИЗ
		|	Документ.ВводОстатковПодарочныхСертификатов.ПодарочныеСертификаты КАК ВводОстатковПодарочныхСертификатовПодарочныеСертификаты
		|ГДЕ
		|	ВводОстатковПодарочныхСертификатовПодарочныеСертификаты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ИсторияСтатусовПодарочныхСертификатов.Добавить();
		Движение.Период = Дата;
		Движение.ПодарочныйСертификат = ВыборкаДетальныеЗаписи.ПодарочныйСертификат;
		Движение.Статус = ВыборкаДетальныеЗаписи.Статус;
		Движение.ДействуетДо = ВыборкаДетальныеЗаписи.ДействуетДо;
		
		Если ВыборкаДетальныеЗаписи.ОстатокСуммы > 0 Тогда
			Движение = Движения.ПодарочныеСертификаты.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.ПодарочныйСертификат = ВыборкаДетальныеЗаписи.ПодарочныйСертификат;
			Движение.Сумма = ВыборкаДетальныеЗаписи.ОстатокСуммы;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
