
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьВалютуИНоминальнуюСтоимость();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВалютуИНоминальнуюСтоимость()
	РеквизитыВидаПодарочныхСертификатов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидПодарочныхСертификатов, "Валюта, НоминальнаяСтоимость");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВидаПодарочныхСертификатов);                                                                                                             
		
	Для Каждого Строка Из Объект.ПодарочныеСертификаты Цикл 
		Строка.НоминальнаяСтоимость = НоминальнаяСтоимость;
		Строка.Валюта = Валюта;
	КонецЦикла;
	
	ИтоговаяСтоимость = СтрШаблон(НСтр("ru = 'Итоговая стоимость:%1%2 %3'"), Символы.Таб, Формат(Объект.Сумма, "ЧДЦ=2; ЧРД=,"), Валюта);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьВалютуИНоминальнуюСтоимость();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьВалютуИНоминальнуюСтоимость();
КонецПроцедуры
