
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДействуетПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДействуетПриИзмененииНаСервере()
	Элементы.ТипТочкиОбмена.ТолькоПросмотр = Объект.Действует И НЕ Объект.Ссылка.Пустая();
	Элементы.ТипТочкиОбмена.ОтметкаНезаполненного = Объект.Действует И НЕ ЗначениеЗаполнено(Объект.ТипТочкиОбмена);
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	ДействуетПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипТочкиОбменаПриИзменении(Элемент)
	Элементы.ТипТочкиОбмена.ОтметкаНезаполненного = Объект.Действует И НЕ ЗначениеЗаполнено(Объект.ТипТочкиОбмена);
КонецПроцедуры
