
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВиртуальныйХост = Запись.ТочкаОбмена.ВиртуальныйХост;
	ТочкаОбменаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТочкаОбменаПриИзмененииНаСервере()
	Элементы.КлючМаршрутизации.Видимость = ЗначениеЗаполнено(Запись.ТочкаОбмена) И 
		RMQ_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ТочкаОбмена, "ТипТочкиОбмена").ТипТочкиОбмена = Перечисления.RMQ_ТипыТочекОбмена.Topic;
КонецПроцедуры

&НаКлиенте
Процедура ТочкаОбменаПриИзменении(Элемент)
	ТочкаОбменаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если RMQ_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ТочкаОбмена, "ТипТочкиОбмена").ТипТочкиОбмена = Перечисления.RMQ_ТипыТочекОбмена.Topic Тогда
		Если НЕ ЗначениеЗаполнено(Запись.КлючМаршрутизации) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Поле ""Ключ маршрутизации"" не заполнено'"), , "КлючМаршрутизации", "Запись", Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
